/*1. Написать две программы, использующие именованные каналы для обмена информацией. Назовем их условно «клиент» и «сервер»
2. Клиент и сервер должны иметь общий заголовочный файл, определяющий требуемые соглашения (имя FIFO, длины строк и т.д.). 
3. Сервер создаёт именованный канал согласно соглашению и ждёт поступления от клиента строки формата: «FILENAME~имя_файла». 
Информация, поступившая до указанной строки, игнорируется. После поступления указанной строки сервер открывает файл, имя 
которого было передано, и выполняет обработку указанного файла согласно варианту задания (имя файла и задание взять из занятия 8). 
Далее, всё, что нашел сервер должно быть записано в новый файл. Процедура взаимодействия заканчивается отправкой клиенту имени 
созданного нового файла. 
4. Клиент выводит приглашение пользователю для ввода имени файла, после чего формирует строку указанного формата и передаёт 
её серверу. После получения итогового сообщения от сервера клиент выводит информацию из файла на экран.*/
#include <stdio.h>
#include <stdlib.h>
#include <fcntl.h>
#include <sys/stat.h>
#include <sys/types.h>
#include <unistd.h>
#include "common.h"
#include <string.h>

int main() {
    char buf[MAX_LEN];
    int fd, n;

    /* Открытие именованного канала */
    fd = open(FIFO_NAME, O_RDWR);

    /* Запрос имени файла у пользователя */
    printf("Enter file name: ");
    fgets(buf, MAX_LEN, stdin);

    /* Удаление символа новой строки */
    buf[strcspn(buf, "\n")] = 0;

    /* Формирование строки в формате "FileName- имяфайла" */
    char message[MAX_LEN];
    snprintf(message, MAX_LEN, "FileName-%s", buf);

    /* Запись в именованный канал */
    write(fd, message, strlen(message));

    printf("1");
    while ((n = read(fd, buf, MAX_LEN)) > 0){
        if (write(1, buf, n) != n){
            printf("Ошибка вывода\n");
            exit(1);
        }
        else 
            printf("1 = %s", buf);
    }
    printf("2");
        
    /* Закрытие именованного канала */
    close(fd);

    return 0;
}