/*a) Разработать программу, принимающую аргументы командной строки и/или читает параметры из переменных среды окружения. Функционал программы 
на данном этапе не ограничивается. Например, на вход программы передаётся путь к файлу и его содержимое выводится в терминал. Программа не 
должна завершать свою работу до получения сигнала остановки.

б) Создать контейнер. Скомпилировать и запустить внутри контейнера программу, разработанную в п. а). Передать программе аргумент или 
переменную окружения при запуске контейнера. 

в) Показать уровни изоляции: Файловая система, процессы, сеть.*/
#include <iostream>

int main(){
    std::string way;
    std::cout << "Введите путь к файлу";
    std::cin >> way;
}