#Написать сценарий, который каждые 2 секунды выводит информацию об активных пользователях:
#1) скрипт должен принимать один аргумент - общее время обновления;
#2) если аргумент не указан, то использовать значение 10 секунд;
#3) перенаправить стандартный вывод/ошибки в файл с присоединением;
#4) очередной вывод сопровождать текущим временем и датой.

#!/bin/bash

read -p "Время обновления: " time
if [[ -z $time ]]; then
    update_time=10
else
    update_time=$time
fi

while sleep $((update_time)); do
    active_users=$(who | wc -l)
    timestamp=$(date +"[%T %F]")
    message="{$timestamp} Активные пользователи: {$active_users}"
    echo $message
done >> log.txt 2>&1
cat log.txt
