/*В соответствии с вариантом задания разработать две программы: программу создания и 
программу обработки бинарного файла. Также необходимо обработать ошибки, которые могут 
возникнуть при открытии, закрытии и выводе файла на экран.
При завершении программы (даже в случае возникновения ошибок) на экран должно быть 
выдано сообщение об авторе программы, учетное имя, группа.*/
/* 1. Создать файл Work.dat, содержащий 6 записей следующей структуры: ФИО рабочих; их 
среднемесячный заработок.
2. Написать программу, выполняющую следующую обработку файла Work.dat:
Вывести ФИО рабочих, имеющих наибольший заработок.
*/

#include <iostream>
#include <fstream>
#include <string>
#include <cstring>

struct Report {
    std::string name; //название начального пункта маршрута
    double money; //номер маршрута
};

int main()
{
    std::ofstream file("Work.dat");
    Report data[6];
    data[0] = {"Мо ск ва", 1000.0};
    data[1] = {"Сан кт-Пет ербург", 2.0};
    data[2] = {"Ки е в", 365.0};
    data[3] = {"М ин ск", 400.0};
    data[4] = {"Ло нд он", 50000.0};
    data[5] = {"Па р иж", 6.0};
    if (file.is_open())
    {
        for (const Report& dat: data)
        {
            file << dat.name << ", "<< dat.money << std::endl;
        }
        for (const Report& dat: data)
        file.close();
        std::cout << "Автор программы: Худеева Валерия." << std::endl << "Группа: ИА-132." << std::endl;
    }
    return 0;
}