/*1. Написать две программы, использующие именованные каналы для 
обмена информацией. Назовем их условно «клиент» и «сервер»
2. Клиент и сервер должны иметь общий заголовочный файл, 
определяющий требуемые соглашения (имя FIFO, длины строк и 
т.д.). 
3. Сервер создаёт именованный канал согласно соглашению и ждёт 
поступления от клиента строки формата: 
«FILENAME~имя_файла». Информация, поступившая до 
указанной строки, игнорируется. После поступления указанной 
строки сервер открывает файл, имя которого было передано, и
выполняет обработку указанного файла согласно варианту задания 
(имя файла и задание взять из занятия 8). Далее, всё, что нашел 
сервер должно быть записано в новый файл. Процедура 
взаимодействия заканчивается отправкой клиенту имени 
созданного нового файла. 
4. Клиент выводит приглашение пользователю для ввода имени 
файла, после чего формирует строку указанного формата и 
передаёт её серверу. После получения итогового сообщения от 
сервера клиент выводит информацию из файла на экран.*/