#Написать скрипт, анализирующий параметры командной строки 
#с помощью команды getopts.
#Скрипт должен выполнять следующую работу:
#Скрипту возможна передача опций –f (короткая) и –m (c 
#дополнительным параметром). При обнаружении этих опций 
#скрипт должен выполнить следующую работу:
#a) на опцию –f выдать на экран приветственное сообщение. 
#b)на опцию –m name проверить, есть ли файл с именем name. 
#Если есть- выдать сообщение «есть», иначе «нет».
#c) предусмотреть обработку недопустимой опции

#!/bin/bash

while getopts "fm:" opt; do
  case ${opt} in
    f)
      echo "Приветики"
      ;;
    m)
      filename=$OPTARG
      if [ -f "$filename" ]; then
        echo "Файл $filename существует"
      else
        echo "Файл $filename не существует"
      fi
      ;;
    \?)
      echo "Недопустимая опция: -$OPTARG" >&2
      exit 1
      ;;
  esac
done
