#1. Используя команду ps вывести информацию обо все процессах системы и ответить на следующие вопросы: сколько 
#процессов в системе? сколько процессов принадлежит Вам?
echo "Информация о всех процессах:"
ps aux

# Сколько процессов в системе?
echo "Сколько процессов в системе:"
ps aux | wc -l

# Сколько процессов принадлежит вам? (замените "your_username" на ваше имя пользователя)
echo "Сколько процессов принадлежит мне"
ps aux | grep "marina" | wc -l

#2. Используя форматный вывод команды ps получить дерево процессов, принадлежащих вашему сеансу. 
# Вывод дерева процессов, принадлежащих вашему сеансу
ps auxf --forest
#3. Используя команду pstree и перенаправление канала вывода вывести дерево процессов в файл ~ /pstrees. 
#Проанализировать результат работы команды. Сравнить с результатами предыдущего пункта. 
#4. Используя команду top описать наиболее активные процессы в системе. 
#5. Выполнить команду man в фоновом режиме. 
#6. Используя команду jobs посмотреть состояние фоновых задач. 
#7. Перевести задачу 1 в интерактивный режим и объяснить, почему выполнение указанной команды было автоматически 
#приостановлено. 
#8. Ответить на вопрос: если запустить в фоновый режим следующий набор команд ls | sort будут ли указанные процессы 
#(ls и sort) входить в одну группу или в разные?
