#!/bin/bash

#1. Используя команду ps вывести информацию обо все процессах системы и ответить на следующие вопросы: сколько
#процессов принадлежит Вам?
echo "Информация о всех процессах:"
ps aux

total_processes=$(ps ax -o pid,user | wc -l)
your_processes=$(ps -u $USER -o pid,user | wc -l)

echo "Всего процессов в системе: $((total_processes-1))"
echo "Процессов, принадлежащих вам: $((your_processes-1))"

#2. Используя форматный вывод команды ps получить дерево процессов, принадлежащих вашему сеансу.
echo "Дерево процессов вашего сеанса:"
ps -ef --forest --pid $your_processes

#3. Используя команду pstree и перенаправление канала вывода вывести дерево процессов в файл ~ /pstrees.
#Проанализировать результат работы команды. Сравнить с результатами предыдущего пункта.
pstree > ~/pstrees
echo "Файл pstrees успешно создан и содержит дерево процессов."

#4. Используя команду top описать наиболее активные процессы в системе.
echo "Наиболее активные процессы в системе:"
top -b -n 1

#5. Выполнить команду man в фоновом режиме.
man bash &

#6. Используя команду jobs посмотреть состояние фоновых задач.
jobs

#7. Перевести задачу 1 в интерактивный режим и объяснить, почему выполнение указанной команды было автоматически
#приостановлено.
echo "Автоматическое приостановление выполнения задачи 1"
read -p "Нажмите любую клавишу, чтобы продолжить..."

# Задача 1 (интерактивный режим)
echo "Всего процессов в системе: $((total_processes-1))"
echo "Процессов, принадлежащих вам: $((your_processes-1))"

#8. Ответить на вопрос: если запустить в фоновый режим следующий набор команд ls | sort будут ли указанные процессы
#(ls и sort) входить в одну группу или в разные?
echo "Команда ls | sort запущена в фоновом режиме"
ls | sort &
ls_sort_group=$(ps -o tpgid= -p $!)
echo "Группа процессов ls | sort: $ls_sort_group"
