#Написать сценарий, который:
#1) каждые N секунд в течение M секунд выводит на экран текущее время;
#2) запускается в фоновом режиме.
#Написать второй сценарий, который ожидает завершения первого задания, 
#после чего печатает сообщение “Продолжительность ожидания составила N 
#секунд”.

#!/bin/bash

N=1        # интервал времени в секундах
M=10       # продолжительность вывода времени в секундах

# Вывод времени каждые N секунд в течение M секунд
total_time=0
while [ $total_time -lt $M ]; do
    time=$(date +"[%T %F]")
    echo "Текущее время: $time"
    sleep $N
    total_time=$((total_time + N))
done
