import numpy as np

# Параметры для графиков
mxs = [0, 0, 0, -1]
osqrs = [1, 3, 0.2, 1]

# Строим графики
for mx, osqr in zip(mxs, osqrs):
    # Генерируем выборку из нормального распределения
    xn = np.random.normal(mx, np.sqrt(osqr), 1000)
    # Определяем матожидание
    mx_xn = sum(xn) / len(xn)
    # Определяем дисперсию
    osqr_xn = sum(xn**2) / len(xn) - mx_xn**2
    # Выводим результаты
    print(f'Матожидание: {mx_xn}, дисперсия: {osqr_xn}')
    print(f'Сравнение с параметрами моделирования: матожидание {mx}, дисперсия {osqr}')
    print('----------------------------------------')